Output from `terraform plan`
```
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_iam_policy.step_function_execution[0] will be destroyed
  # (because aws_iam_policy.step_function_execution is not in configuration)
  - resource "aws_iam_policy" "step_function_execution" {
      - arn              = "arn:aws:iam::004723187462:policy/dpr-replay-pipeline-nomis-sentence-production-policy" -> null
      - attachment_count = 0 -> null
      - id               = "arn:aws:iam::004723187462:policy/dpr-replay-pipeline-nomis-sentence-production-policy" -> null
      - name             = "dpr-replay-pipeline-nomis-sentence-production-policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:UpdateLogDelivery",
                          - "logs:PutResourcePolicy",
                          - "logs:ListLogDeliveries",
                          - "logs:GetLogDelivery",
                          - "logs:DescribeResourcePolicies",
                          - "logs:DescribeLogGroups",
                          - "logs:DeleteLogDelivery",
                          - "logs:CreateLogDelivery",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAQCGMGD4DJ2RPUCYRK" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_iam_role.step_function_role[0] will be destroyed
  # (because aws_iam_role.step_function_role is not in configuration)
  - resource "aws_iam_role" "step_function_role" {
      - arn                   = "arn:aws:iam::004723187462:role/dpr-replay-pipeline-nomis-sentence-production-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "states.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-04-18T13:29:54Z" -> null
      - force_detach_policies = false -> null
      - id                    = "dpr-replay-pipeline-nomis-sentence-production-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::004723187462:policy/dpr_invoke_lambda_policy",
          - "arn:aws:iam::004723187462:policy/dpr_start_dms_task_policy",
          - "arn:aws:iam::004723187462:policy/dpr_start_glue_job_policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "dpr-replay-pipeline-nomis-sentence-production-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAQCGMGD4DBRQE6PHLS" -> null
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::004723187462:policy/dpr_invoke_lambda_policy"] will be destroyed
  # (because aws_iam_role_policy_attachment.step_function_role_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      - id         = "dpr-replay-pipeline-nomis-sentence-production-role-20240418133005485700000064" -> null
      - policy_arn = "arn:aws:iam::004723187462:policy/dpr_invoke_lambda_policy" -> null
      - role       = "dpr-replay-pipeline-nomis-sentence-production-role" -> null
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::004723187462:policy/dpr_start_dms_task_policy"] will be destroyed
  # (because aws_iam_role_policy_attachment.step_function_role_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      - id         = "dpr-replay-pipeline-nomis-sentence-production-role-2024090614530847810000003d" -> null
      - policy_arn = "arn:aws:iam::004723187462:policy/dpr_start_dms_task_policy" -> null
      - role       = "dpr-replay-pipeline-nomis-sentence-production-role" -> null
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::004723187462:policy/dpr_start_glue_job_policy"] will be destroyed
  # (because aws_iam_role_policy_attachment.step_function_role_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      - id         = "dpr-replay-pipeline-nomis-sentence-production-role-2024041813300899160000006f" -> null
      - policy_arn = "arn:aws:iam::004723187462:policy/dpr_start_glue_job_policy" -> null
      - role       = "dpr-replay-pipeline-nomis-sentence-production-role" -> null
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      ~ definition    = jsonencode(
          ~ {
              ~ States  = {
                  ~ "Archive Remaining Raw Files"                          = {
                      ~ Parameters = {
                          ~ Arguments = {
                              + "--dpr.datastorage.retry.maxAttempts"     = "10"
                              + "--dpr.datastorage.retry.maxWaitMillis"   = "10000"
                              + "--dpr.datastorage.retry.minWaitMillis"   = "1000"
                                # (5 unchanged attributes hidden)
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Copy Archived Data to Raw Bucket"                     = {
                      ~ Parameters = {
                          ~ Arguments = {
                              + "--dpr.datastorage.retry.maxAttempts"         = "10"
                              + "--dpr.datastorage.retry.maxWaitMillis"       = "10000"
                              + "--dpr.datastorage.retry.minWaitMillis"       = "1000"
                                # (6 unchanged attributes hidden)
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Copy Curated Data to Temp-Reload Bucket"              = {
                      ~ Parameters = {
                          ~ Arguments = {
                              + "--dpr.datastorage.retry.maxAttempts"     = "10"
                              + "--dpr.datastorage.retry.maxWaitMillis"   = "10000"
                              + "--dpr.datastorage.retry.minWaitMillis"   = "1000"
                                # (5 unchanged attributes hidden)
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Resume DMS Replication Task"                          = {
                      ~ Parameters = {
                          ~ ReplicationTaskArn       = "arn:aws:dms:eu-west-2:004723187462:task:5M7WDI6ZYFAXXNDUCX23IWLZIU" -> ""
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  + "Run Compaction Job on Curated Zone"                   = {
                      + Next       = "Run Vacuum Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "sentence"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-production"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-production/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-production"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Structured Zone"                = {
                      + Next       = "Run Vacuum Job on Structured Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "sentence"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-production"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-production/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-production"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Curated Zone"                       = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "sentence"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-production"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-production/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-production"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Structured Zone"                    = {
                      + Next       = "Run Compaction Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "sentence"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-production"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-production/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-production"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  ~ "Start Glue Batch Job"                                 = {
                      ~ Next       = "Start Glue Streaming Job" -> "Run Compaction Job on Structured Zone"
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Stop DMS Replication Task"                            = {
                      ~ Parameters = {
                          ~ Arguments = {
                              ~ "--dpr.dms.replication.task.id" = "dpr-dms-nomis-oracle-s3-sentence-task-production" -> ""
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                    # (13 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id            = "arn:aws:states:eu-west-2:004723187462:stateMachine:dpr-replay-pipeline-nomis-sentence-production"
        name          = "dpr-replay-pipeline-nomis-sentence-production"
      ~ role_arn      = "arn:aws:iam::004723187462:role/dpr-replay-pipeline-nomis-sentence-production-role" -> "arn:aws:iam::004723187462:role/dpr-step-function-execution-role"
        tags          = {
            "Domain"         = "sentence"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (7 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.replay-pipeline["transactions"].module.replay_pipeline.aws_iam_policy.step_function_execution[0] will be destroyed
  # (because aws_iam_policy.step_function_execution is not in configuration)
  - resource "aws_iam_policy" "step_function_execution" {
      - arn              = "arn:aws:iam::004723187462:policy/dpr-replay-pipeline-nomis-transactions-production-policy" -> null
      - attachment_count = 0 -> null
      - id               = "arn:aws:iam::004723187462:policy/dpr-replay-pipeline-nomis-transactions-production-policy" -> null
      - name             = "dpr-replay-pipeline-nomis-transactions-production-policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:UpdateLogDelivery",
                          - "logs:PutResourcePolicy",
                          - "logs:ListLogDeliveries",
                          - "logs:GetLogDelivery",
                          - "logs:DescribeResourcePolicies",
                          - "logs:DescribeLogGroups",
                          - "logs:DeleteLogDelivery",
                          - "logs:CreateLogDelivery",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAQCGMGD4DBWXJX36LJ" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
    }

  # module.replay-pipeline["transactions"].module.replay_pipeline.aws_iam_role.step_function_role[0] will be destroyed
  # (because aws_iam_role.step_function_role is not in configuration)
  - resource "aws_iam_role" "step_function_role" {
      - arn                   = "arn:aws:iam::004723187462:role/dpr-replay-pipeline-nomis-transactions-production-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "states.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-09-06T14:52:56Z" -> null
      - force_detach_policies = false -> null
      - id                    = "dpr-replay-pipeline-nomis-transactions-production-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::004723187462:policy/dpr_invoke_lambda_policy",
          - "arn:aws:iam::004723187462:policy/dpr_start_dms_task_policy",
          - "arn:aws:iam::004723187462:policy/dpr_start_glue_job_policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "dpr-replay-pipeline-nomis-transactions-production-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAQCGMGD4DO2U25TFBB" -> null
    }

  # module.replay-pipeline["transactions"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::004723187462:policy/dpr_invoke_lambda_policy"] will be destroyed
  # (because aws_iam_role_policy_attachment.step_function_role_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      - id         = "dpr-replay-pipeline-nomis-transactions-production-role-20240906145306177800000027" -> null
      - policy_arn = "arn:aws:iam::004723187462:policy/dpr_invoke_lambda_policy" -> null
      - role       = "dpr-replay-pipeline-nomis-transactions-production-role" -> null
    }

  # module.replay-pipeline["transactions"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::004723187462:policy/dpr_start_dms_task_policy"] will be destroyed
  # (because aws_iam_role_policy_attachment.step_function_role_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      - id         = "dpr-replay-pipeline-nomis-transactions-production-role-20240906145305431600000016" -> null
      - policy_arn = "arn:aws:iam::004723187462:policy/dpr_start_dms_task_policy" -> null
      - role       = "dpr-replay-pipeline-nomis-transactions-production-role" -> null
    }

  # module.replay-pipeline["transactions"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::004723187462:policy/dpr_start_glue_job_policy"] will be destroyed
  # (because aws_iam_role_policy_attachment.step_function_role_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      - id         = "dpr-replay-pipeline-nomis-transactions-production-role-20240906145305979300000022" -> null
      - policy_arn = "arn:aws:iam::004723187462:policy/dpr_start_glue_job_policy" -> null
      - role       = "dpr-replay-pipeline-nomis-transactions-production-role" -> null
    }

  # module.replay-pipeline["transactions"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      ~ definition    = jsonencode(
          ~ {
              ~ States  = {
                  ~ "Archive Remaining Raw Files"                          = {
                      ~ Parameters = {
                          ~ Arguments = {
                              + "--dpr.datastorage.retry.maxAttempts"     = "10"
                              + "--dpr.datastorage.retry.maxWaitMillis"   = "10000"
                              + "--dpr.datastorage.retry.minWaitMillis"   = "1000"
                                # (5 unchanged attributes hidden)
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Copy Archived Data to Raw Bucket"                     = {
                      ~ Parameters = {
                          ~ Arguments = {
                              + "--dpr.datastorage.retry.maxAttempts"         = "10"
                              + "--dpr.datastorage.retry.maxWaitMillis"       = "10000"
                              + "--dpr.datastorage.retry.minWaitMillis"       = "1000"
                                # (6 unchanged attributes hidden)
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Copy Curated Data to Temp-Reload Bucket"              = {
                      ~ Parameters = {
                          ~ Arguments = {
                              + "--dpr.datastorage.retry.maxAttempts"     = "10"
                              + "--dpr.datastorage.retry.maxWaitMillis"   = "10000"
                              + "--dpr.datastorage.retry.minWaitMillis"   = "1000"
                                # (5 unchanged attributes hidden)
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Resume DMS Replication Task"                          = {
                      ~ Parameters = {
                          ~ ReplicationTaskArn       = "arn:aws:dms:eu-west-2:004723187462:task:RFOA3WUR2NDT3NFNRLP5BPYVPM" -> ""
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  + "Run Compaction Job on Curated Zone"                   = {
                      + Next       = "Run Vacuum Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "transactions"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-production"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-production/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-production"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Structured Zone"                = {
                      + Next       = "Run Vacuum Job on Structured Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "transactions"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-production"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-production/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-production"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Curated Zone"                       = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "transactions"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-production"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-production/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-production"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Structured Zone"                    = {
                      + Next       = "Run Compaction Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "transactions"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-production"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-production/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-production"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  ~ "Start Glue Batch Job"                                 = {
                      ~ Next       = "Start Glue Streaming Job" -> "Run Compaction Job on Structured Zone"
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Stop DMS Replication Task"                            = {
                      ~ Parameters = {
                          ~ Arguments = {
                              ~ "--dpr.dms.replication.task.id" = "dpr-dms-nomis-oracle-s3-transactions-task-production" -> ""
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                    # (13 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id            = "arn:aws:states:eu-west-2:004723187462:stateMachine:dpr-replay-pipeline-nomis-transactions-production"
        name          = "dpr-replay-pipeline-nomis-transactions-production"
      ~ role_arn      = "arn:aws:iam::004723187462:role/dpr-replay-pipeline-nomis-transactions-production-role" -> "arn:aws:iam::004723187462:role/dpr-step-function-execution-role"
        tags          = {
            "Domain"         = "transactions"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (6 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_iam_policy.step_function_execution[0] will be destroyed
  # (because aws_iam_policy.step_function_execution is not in configuration)
  - resource "aws_iam_policy" "step_function_execution" {
      - arn              = "arn:aws:iam::004723187462:policy/dpr-replay-pipeline-nomis-visits-production-policy" -> null
      - attachment_count = 0 -> null
      - id               = "arn:aws:iam::004723187462:policy/dpr-replay-pipeline-nomis-visits-production-policy" -> null
      - name             = "dpr-replay-pipeline-nomis-visits-production-policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:UpdateLogDelivery",
                          - "logs:PutResourcePolicy",
                          - "logs:ListLogDeliveries",
                          - "logs:GetLogDelivery",
                          - "logs:DescribeResourcePolicies",
                          - "logs:DescribeLogGroups",
                          - "logs:DeleteLogDelivery",
                          - "logs:CreateLogDelivery",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAQCGMGD4DNMEXFIFH5" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_iam_role.step_function_role[0] will be destroyed
  # (because aws_iam_role.step_function_role is not in configuration)
  - resource "aws_iam_role" "step_function_role" {
      - arn                   = "arn:aws:iam::004723187462:role/dpr-replay-pipeline-nomis-visits-production-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "states.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-04-18T13:29:50Z" -> null
      - force_detach_policies = false -> null
      - id                    = "dpr-replay-pipeline-nomis-visits-production-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::004723187462:policy/dpr_invoke_lambda_policy",
          - "arn:aws:iam::004723187462:policy/dpr_start_dms_task_policy",
          - "arn:aws:iam::004723187462:policy/dpr_start_glue_job_policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "dpr-replay-pipeline-nomis-visits-production-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAQCGMGD4DA4AU7BHQT" -> null
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::004723187462:policy/dpr_invoke_lambda_policy"] will be destroyed
  # (because aws_iam_role_policy_attachment.step_function_role_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      - id         = "dpr-replay-pipeline-nomis-visits-production-role-20240418133007185000000065" -> null
      - policy_arn = "arn:aws:iam::004723187462:policy/dpr_invoke_lambda_policy" -> null
      - role       = "dpr-replay-pipeline-nomis-visits-production-role" -> null
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::004723187462:policy/dpr_start_dms_task_policy"] will be destroyed
  # (because aws_iam_role_policy_attachment.step_function_role_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      - id         = "dpr-replay-pipeline-nomis-visits-production-role-20240906145308109000000031" -> null
      - policy_arn = "arn:aws:iam::004723187462:policy/dpr_start_dms_task_policy" -> null
      - role       = "dpr-replay-pipeline-nomis-visits-production-role" -> null
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::004723187462:policy/dpr_start_glue_job_policy"] will be destroyed
  # (because aws_iam_role_policy_attachment.step_function_role_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      - id         = "dpr-replay-pipeline-nomis-visits-production-role-2024041813300420010000005f" -> null
      - policy_arn = "arn:aws:iam::004723187462:policy/dpr_start_glue_job_policy" -> null
      - role       = "dpr-replay-pipeline-nomis-visits-production-role" -> null
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      ~ definition    = jsonencode(
          ~ {
              ~ States  = {
                  ~ "Archive Remaining Raw Files"                          = {
                      ~ Parameters = {
                          ~ Arguments = {
                              + "--dpr.datastorage.retry.maxAttempts"     = "10"
                              + "--dpr.datastorage.retry.maxWaitMillis"   = "10000"
                              + "--dpr.datastorage.retry.minWaitMillis"   = "1000"
                                # (5 unchanged attributes hidden)
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Copy Archived Data to Raw Bucket"                     = {
                      ~ Parameters = {
                          ~ Arguments = {
                              + "--dpr.datastorage.retry.maxAttempts"         = "10"
                              + "--dpr.datastorage.retry.maxWaitMillis"       = "10000"
                              + "--dpr.datastorage.retry.minWaitMillis"       = "1000"
                                # (6 unchanged attributes hidden)
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Copy Curated Data to Temp-Reload Bucket"              = {
                      ~ Parameters = {
                          ~ Arguments = {
                              + "--dpr.datastorage.retry.maxAttempts"     = "10"
                              + "--dpr.datastorage.retry.maxWaitMillis"   = "10000"
                              + "--dpr.datastorage.retry.minWaitMillis"   = "1000"
                                # (5 unchanged attributes hidden)
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Resume DMS Replication Task"                          = {
                      ~ Parameters = {
                          ~ ReplicationTaskArn       = "arn:aws:dms:eu-west-2:004723187462:task:WTN7F75OCVCSHHMPVLEGIUYC5E" -> ""
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  + "Run Compaction Job on Curated Zone"                   = {
                      + Next       = "Run Vacuum Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "visits"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-production"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-production/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-production"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Structured Zone"                = {
                      + Next       = "Run Vacuum Job on Structured Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "visits"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-production"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-production/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-production"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Curated Zone"                       = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "visits"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-production"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-production/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-production"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Structured Zone"                    = {
                      + Next       = "Run Compaction Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "visits"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-production"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-production/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-production"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  ~ "Start Glue Batch Job"                                 = {
                      ~ Next       = "Start Glue Streaming Job" -> "Run Compaction Job on Structured Zone"
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Stop DMS Replication Task"                            = {
                      ~ Parameters = {
                          ~ Arguments = {
                              ~ "--dpr.dms.replication.task.id" = "dpr-dms-nomis-oracle-s3-visits-task-production" -> ""
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                    # (13 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id            = "arn:aws:states:eu-west-2:004723187462:stateMachine:dpr-replay-pipeline-nomis-visits-production"
        name          = "dpr-replay-pipeline-nomis-visits-production"
      ~ role_arn      = "arn:aws:iam::004723187462:role/dpr-replay-pipeline-nomis-visits-production-role" -> "arn:aws:iam::004723187462:role/dpr-step-function-execution-role"
        tags          = {
            "Domain"         = "visits"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (7 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be created
  + resource "aws_dms_endpoint" "dms-s3-target-source" {
      + certificate_arn             = (known after apply)
      + database_name               = (sensitive value)
      + endpoint_arn                = (known after apply)
      + endpoint_id                 = "dpr-dms-dps-activities-pgres-source-endpoint"
      + endpoint_type               = "source"
      + engine_name                 = "postgres"
      + extra_connection_attributes = (known after apply)
      + id                          = (known after apply)
      + kms_key_arn                 = (known after apply)
      + password                    = (sensitive value)
      + port                        = 5432
      + server_name                 = (sensitive value)
      + ssl_mode                    = "none"
      + tags                        = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                    = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + username                    = (sensitive value)

      + postgres_settings {
          + heartbeat_enable       = true
          + map_boolean_as_boolean = true
        }
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_dms_s3_endpoint.dms-s3-target-endpoint[0] will be created
  + resource "aws_dms_s3_endpoint" "dms-s3-target-endpoint" {
      + add_column_name                             = false
      + bucket_name                                 = "dpr-raw-zone-production"
      + cdc_inserts_and_updates                     = true
      + cdc_inserts_only                            = false
      + cdc_max_batch_interval                      = 10
      + cdc_path                                    = "cdc"
      + certificate_arn                             = (known after apply)
      + compression_type                            = "NONE"
      + csv_delimiter                               = ","
      + csv_row_delimiter                           = "\\n"
      + data_format                                 = "parquet"
      + date_partition_enabled                      = false
      + enable_statistics                           = true
      + endpoint_arn                                = (known after apply)
      + endpoint_id                                 = "dpr-dms-dps-activities-s3-target-endpoint"
      + endpoint_type                               = "target"
      + engine_display_name                         = (known after apply)
      + external_id                                 = (known after apply)
      + glue_catalog_generation                     = false
      + id                                          = (known after apply)
      + include_op_for_full_load                    = true
      + kms_key_arn                                 = (known after apply)
      + max_file_size                               = 120000
      + parquet_timestamp_in_millisecond            = false
      + preserve_transactions                       = false
      + rfc_4180                                    = true
      + service_access_role_arn                     = (known after apply)
      + ssl_mode                                    = (known after apply)
      + status                                      = (known after apply)
      + tags                                        = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                                    = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + timestamp_column_name                       = "_timestamp"
      + use_csv_no_sup_value                        = false
      + use_task_start_time_for_full_load_timestamp = false
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_iam_policy.dms-operator-s3-policy[0] will be created
  + resource "aws_iam_policy" "dms-operator-s3-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dpr-dms-dps-activities-operator-s3-target-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:*",
                          + "cloudwatch:*",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcs",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:*Object*",
                          + "s3:PutObjectTagging",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3::*:dpr-*/*",
                          + "arn:aws:s3::*:dpr-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:ListAccessPoints",
                          + "s3:ListJobs",
                          + "s3:ListObjects",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_iam_policy.dms-s3-target-policy[0] will be created
  + resource "aws_iam_policy" "dms-s3-target-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dpr-dms-dps-activities-s3-target-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                          + "kms:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_iam_role.dms-operator-s3-target-role[0] will be created
  + resource "aws_iam_role" "dms-operator-s3-target-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-dps-activities-operator-s3-target-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_iam_role.dms-s3-role[0] will be created
  + resource "aws_iam_role" "dms-s3-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-dps-activities-s3-endpoint-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-operator-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-operator-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-dps-activities-operator-s3-target-role"
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-dps-activities-s3-endpoint-role"
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be updated in-place
  ~ resource "aws_dms_endpoint" "dms-s3-target-source" {
      ~ database_name               = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ extra_connection_attributes = (sensitive value)
        id                          = "dpr-dms-nomis-oracle-source-endpoint"
      ~ password                    = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ port                        = (sensitive value)
      ~ server_name                 = (sensitive value)
        tags                        = {
            "DMS_Source"     = "nomis"
            "Domain"         = "Common"
            "Jira"           = "main"
            "Resource_Type"  = "DMS Source Endpoint"
            "Service_Bundle" = "true"
        }
        # (8 unchanged attributes hidden)

      ~ postgres_settings {
          ~ heartbeat_enable             = false -> true
            # (7 unchanged attributes hidden)
        }
    }

Plan: 408 to add, 317 to change, 420 to destroy.

```